{
  "title": {
    "frontend": "frontend",
    "backend": "backend",
    "web": "web",
    "mobile": "mobiel",
    "development": "ontwikkeling"
  },
  "about": {
    "whoIAm": "Wie ben ik",
    "school": "Ik ben een 19-jarige student uit Duitsland die net zijn middelbare schooldiploma (Abitur) heeft behaald met een focus op wiskunde en informatica. De afgelopen 5 jaar heb ik vaardigheden opgebouwd in verschillende ontwikkelingsgebieden met een focus op web- en app-ontwikkeling. Ik heb gewerkt aan verschillende projecten, waarvan enkele hieronder worden weergegeven.",
    "work": "Daarnaast werk ik sinds 2021 als junior ontwikkelaar bij een lokaal bedrijf, een paar uur per week, terwijl ik op school zat. Daar werk ik aan een mobiele app gebouwd met react-native.",
    "university": "Vanaf het najaar van 2025 ga ik informatica studeren aan de Technische Universiteit München. In de tussentijd heb ik mijn baan als applicatieontwikkelaar behouden en aan enkele hobbyprojecten gewerkt."
  },
  "projects": {
    "whatIHaveWorkedOn": "Waar ik aan heb gewerkt",
    "description": "Hier zijn enkele projecten waaraan ik de afgelopen jaren heb gewerkt",
    "motomeet": {
      "title": "MotoMeet",
      "description": "Een platform voor motorrijders waarmee ze andere motorrijders kunnen ontmoeten en samen ritten of bijeenkomsten kunnen plannen. MotoMeet is gebouwd met Expo en Supabase en is tot nu toe mijn grootste zijproject."
    },
    "mygainplan": {
      "title": "MyGainplan",
      "description": "Een op sociale media gebaseerde fitness-app die gebruikers helpt bij het beheren en bijwerken van hun trainingsplannen. MyGainplan is gebouwd met react-native, MySQL, node.js en express.js."
    },
    "moviematch": {
      "title": "Movie Match",
      "description": "Een web-app die je helpt om samen met je partner een film te vinden die je op je volgende filmavond kunt kijken op basis van je voorkeuren. Movie Match is gebouwd met next.js en TypeScript en gebruikt de TMDb API om filminformatie op te halen."
    },
    "animatedSolarSystem": {
      "title": "Geanimeerd 3D Zonnestelsel",
      "description": "Een geanimeerd 3D zonnestelsel gemaakt met Three.js dat de draaisnelheid van de planeten om de zon en om hun eigen as visualiseert. Ik heb dit project gebouwd tijdens een stage bij een webontwikkelingsbedrijf."
    },
    "playground": {
      "title": "Speeltuin",
      "description": "Dit is een pagina waar ik dingen laat zien die ik heb uitgeprobeerd en minigames die ik heb gebouwd, die me hebben geconfronteerd met allerlei nieuwe en interessante uitdagingen"
    }
  },
  "techstack": {
    "whatTechStack": "Welke technologiestapel ik gebruik",
    "description": "Mijn huidige technologiestapel bestaat uit next.js en react-native voor de frontend en node.js met express.js voor de backend. Ik gebruik MySQL voor mijn databases en TypeScript als mijn favoriete programmeertaal. Voor het opslaan en hosten van mijn projecten gebruik ik GitHub en Docker.",
    "subdescription": "Daarnaast heb ik ook ervaring met verschillende andere technologieën en programmeertalen zoals Java, C#, Python, Unity en Three.js."
  },
  "contact": {
    "contact": "Contact",
    "description": "Als je contact met me wilt opnemen, voel je vrij om me een e-mail te sturen naar {email} of het contactformulier hieronder te gebruiken.",
    "name": "Naam",
    "email": "E-mail",
    "message": "Bericht",
    "send": "Verstuur"
  },
  "nav": {
    "about": "Wie ben ik",
    "projects": "Projecten",
    "techstack": "Technologiestapel",
    "contact": "Contact"
  },
  "footer": {
    "madeWith": "Gemaakt met {heart} door {name}"
  }
}